# Написать программу, которая запрашивает у пользователя строку чисел, разделённых пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
# разделённых пробелом и снова нажать Enter. Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается. Если специальный символ введён после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

result = []
while True:
    l = input("Введите строку чисел, разделенных пробелом: ")
    try:
        for w in l.split():
            result.append(int(w))
        print("Сумма чисел на данный момент: ", sum(result))
    except ValueError:
            if l.isdigit():
                result.append(int(l))
            print("Подсчет закончен. Не нужно было вводить что-то, кроме цифр. Сумма: ", sum(result))
            break